"""
У цьому завданні реалізуй функцію sum_two_lists(), яка:
Приймає два списки чисел однакової довжини.
Повертає суму всіх елементів цих списків. Для цього:
Використай цикл for для перебору елементів обох списків.
Додавай кожний елемент з першого списку до відповідного елементу з другого списку.
Результати запиши в новий список result_list.
Поверни результат за допомогою ключового слова return.

Наприклад:
sum_two_lists([1, 2], [3, 4]) # [4, 6]
sum_two_lists([1, 2, 3, 4], [5, 6, 7, 8]) # [6, 8, 10, 12]
sum_two_lists([], []) # []
"""

def sum_two_lists(list1, list2):
    result_list = []
    for index in range(0, len(list1)):
        result_list.append(list1[index] + list2[index])
    return result_list
